Repository: NicolayAdamchuk/SketchFull
Catalog: SketchFull/Resourses/Strings/Texts.*.resx
Languages: ru

# Aligment
source: Perform alignment
ru: Выполнить выравнивание

source: Attension
ru: Предупреждение

source: Cancel
ru: Отмена

# DeleteGroup
source: Delete unnecessary sketches while updating
ru: Удалять лишние эскизы при обновлении

# Dialog1
source: Reinforcement direction
ru: Направление армирования

# Dialog2
source: Reinforcement layer
ru: Слой армирования

# Dialog3
source: Major
ru: Основное

# Dialog4
source: Minor
ru: Второстепенное

# Dialog5
source: Top
ru: Верхний

# Dialog6
source: Bottom
ru: Нижний

source: Font
ru: Шрифт

# Info1
source: This view is not suitable for placing sketches.
ru: Данный вид не подходит для размещения эскизов.

# Info10
source: Unable to create a temporary view for sketching. \n Select a different view to place the sketch.
ru: Невозможно создать временный вид для создания эскиза.\n Выберите другой вид для размещения эскиза.

# Info2
source: You are trying to create too many sketches at once. \n This will take a long time. We recommend that you select fewer members for sketching. \n Continue creating?
ru: Вы пытаетесь создать слишком много эскизов одновременно.//n Это займет много времени. Рекомендуем выбрать меньшее число стержней для создания эскизов.//n Продолжать создание ?

# Info3
source: No rebars for sketching.
ru: Нет арматуры для создания эскизов.

# Info4
source: Unable to determine the insertion point for sketches. Assign a work plane.
ru: Невозможно определить точку вставки эскизов. Назначьте рабочую плоскость.

# Info5
source: The sketch insertion point outside the drawing area. Sketch: will not be visible or partially hidden.
ru: Точка вставки эскиза вне области чертежа. Эскиз: не будет виден или будет частично скрыт.

# Info6
source: The sketch will not be visible. Check the visibility settings of the LINE CATEGORIES.
ru: Эскиз не будет виден. Проверьте настройки видимости КАТЕГОРИЙ ЛИНИЙ.

# Info7
source: No sketches for renovation.
ru: Нет эскизов для обновления.

# Info8
source: For this reinforcement: Sketch detected in a different view. \n We recommend using standard copy. \n A new independent sketch type will be created. Create a new sketch?
ru: Для данного армирования: обнаружен эскиз на другом виде.\n Рекомендуем воспользоваться стандартным копированием.\n Будет создан новый независимый тип эскиза. Создавать новый эскиз?

# Info9
source: For this reinforcement: there are already multiple instances of the sketch in the current view. /n ALL SKETCHES FROM ALL VIEWS will be deleted and a new sketch type created. /n Create a new sketch?
ru: Для данного армирования: на текущем виде уже существует несколько экземпляров эскиза./n Будут удалены ВСЕ ЭСКИЗЫ СО ВСЕХ ВИДОВ и создан новый тип эскиза./n Создавать новый эскиз?

# Label1
source: Use as prefix
ru: Использовать как префикс

# LabelScale
source: coeff.
ru: масштаба

# LabelScale0
source: Scale
ru: Коэфф.

# Lines
source: Line types
ru: Тип линии

# NameBox1
source: Tag for sketch
ru: Марка для эскиза

# NameImage
source: Reinforcement sketch-drawing
ru: Эскизы-чертежи арматуры

# NamePanel
source: Reinforcement: tools
ru: Арматура: инструменты

# pathToHelp
source: \\Resources\\Help\\Sketch reinforcement.chm
ru: \\Resources\\Help\\Sketch reinforcement_ru.chm

# PathToHelpFile
source: c:\\ProgramData\\Autodesk\\ApplicationPlugins\\ADNPlugin-SketchReinforcement.bundle\\Contents\\Resources\\Help\\Sketch reinforcement.chm
ru: c:\\ProgramData\\Autodesk\\ApplicationPlugins\\ADNPlugin-SketchReinforcement.bundle\\Contents\\Resources\\Help\\Sketch reinforcement_ru.chm

# Process1
source: Sketching process
ru: Процесс создания эскизов

# Process2
source: The process of placing sketches
ru: Процесс расстановки эскизов

# Process3
source: The process of updating all sketches in a project
ru: Процесс обновления всех эскизов в проекте

# Process4
source: Process for updating sketches in the current view
ru: Процесс обновления эскизов на текущем виде

# SelectRebar
source: Select Rebar or Area or Path reinforcement
ru: Выберите Cтержень или По площади или По траектории

# ShowInsertPoint
source: Specify sketch insertion point
ru: Укажите точку вставки эскиза

# Title1
source: Problem
ru: Проблема

# Title2
source: Structural area reinforcement
ru: Армирование по площади

# Title3
source: Rebar sketching
ru: Создание эскизов для арматуры

# TotalLength
source: Add Ø and total length
ru: Добавить Ø и общую длину

# Update
source: Update all
ru: Обновить все

source: Update view
ru: Обновить вид

# VersionNumber
source: Add-in is for version not older 2023
ru: Приложение предназначено для версии не старше 2023
